Repository: hexlet-basics/hexlet_basics
Catalog: services/web/priv/gettext/*/LC_MESSAGES/default.po
Languages: ru

source: Start
ru: Начать

source: Failed to authenticate.
ru: Ошибка аутентификации

source: Require auth
ru: Требуется аутентификация

source: Sign In
ru: Войти

source: Sign Out
ru: Выйти

source: Successfully authenticated.
ru: Вы авторизовались

source: You did it!
ru: Вы прошли все доступные упражнения. Скоро появятся новые.

source: You have been logged out!
ru: Вы вышли

source: Exercise available only for signed in users
ru: Упражнение доступно только для авторизованных пользователей

source: discuss
ru: Обсуждение

source: instructions
ru: Задание

source: lesson
ru: Урок

source: Code Basics
ru: Обучение программированию

source: Continue Learning
ru: Продолжить обучение

source: Start learning
ru: Начать обучение

source: Blog
ru: Блог

source: Chat
ru: Чат сообщества

source: Guides
ru: Гайды

source: Matrix
ru: Матрица компетентности

source: Projects
ru: Проекты

source: Recommended Books
ru: Рекомендуемые книги

source: Facebook
ru: Code Basics на Facebook

source: Source code
ru: Исходный код

source: tips
ru: Советы

source: definitions
ru: Определения

source: Credits
ru: При поддержке сообщества Хекслет.

source: All lessons completed!
ru: Все уроки завершены!

source: Code Basics Description
ru: Бесплатные практические уроки по программированию для тех, кто начинает с нуля

source: Code Basics Author
ru: Кирилл Мокевнин, Рахим Давлеткалиев, Наталия Басс

source: Code Basics Title
ru: Code Basics: основы программирования

source: About
ru: О проекте

source: Courses in development
ru: Курсы в разработке

source: Courses in development description
ru: Данные курсы находятся в разработке и не являются финальной версией. Вы можете помочь в разработке, прислав Pull Request в репозиторий GitHub

source: Only for signed users
ru: Упражнение доступно только авторизованным пользователям.

source: Please Sign In
ru: Пожалуйста, авторизуйтесь, это необходимо для отслеживания прогресса выполнения уроков. Если у вас ещё нет учётной записи, то сейчас самое время создать аккаунт.

source: Continue
ru: Продолжить

source: issues
ru: Нашли ошибку? Есть что добавить? Пулреквесты приветствуются

source: Contributions
ru: Исходный код платформы Code Basics, всех уроков и упражнений доступен на GitHub. Вы можете поучаствовать в процессе улучшения уроков, исправления неточностей и расширения курсов на другие языки программирования.

source: Extended credits
ru: Идея, учебный план, платформа: Кирилл Мокевнин. Уроки (9 базовых модулей): Рахим Давлеткалиев и Наталия Басс. Расширения и адаптация: Кирилл Мокевнин, Улугбек Туйчиев, Алексей Пыльцын и другие участники сообщества Хекслет.

source: Projects goal
ru: Цель Code Basics — предоставить качественные интерактивные уроки по основам программирования бесплатно, для всех.

source: OG title php
ru: PHP для начинающих

source: OG description php
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на PHP. Он готовит плацдарм для написания осмысленных программ

source: OG title javascript
ru: JavaScript для начинащих

source: OG description javascript
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на Javascript. Он готовит плацдарм для написания осмысленных программ

source: OG title python
ru: Python для начинающих

source: OG description python
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на Python. Он готовит плацдарм для написания осмысленных программ

source: OG title racket
ru: Язык Racket

source: OG description racket
ru: Racket относится к семейству Lisp-языков. Эти языки настолько не похожи на все остальное, что даже опытным программистам приходится изучать их с самых основ. Этот модуль посвящен знакомству с синтаксисом и концепциями лежащими в основе любого лиспа.

source: OG title java
ru: Java для начинающих

source: OG description java
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на Java. Он готовит плацдарм для написания осмысленных программ

source: OG title html
ru: HTML для начинающих

source: OG description html
ru: Для стандартизации вывода текста внутри браузера был придуман стандарт HTML, описывающий правила оформления текстовых данных для корректного вывода. Этот курс посвящён азам HTML разметки, работы с типографикой, вывода медиа документов и работы с формами.

source: OG title css
ru: Code Basics: основы использования CSS

source: OG description css
ru: Cascading Style Sheets (CSS) — каскадные таблицы стилей, которые позволяют оформлять содержимое страницы в соответствии с описанными правилами. Стили текста, расположение блоков на странице, анимация — всё это описывается с помощью каскадных таблиц стилей.

source: OG title ruby
ru: Обучение Ruby

source: OG description ruby
ru: Руби — язык, созданный для того, чтобы программисты были счастливы. Он взял из себя лучшее из Lisp, Smalltalk и Perl — он объектно-ориентирован, но в то же время его декларативность позволяет писать в процедурной и функциональной парадигме.

source: OG title elixir
ru: Язык Elixir

source: OG description elixir
ru: Эликсир — язык программирования, работающий поверх Erlang. Как Erlang, это — функциональный язык со строгими вычислениями, однократным присвоением и динамической типизацией, созданный, чтобы поддерживать распределенные, отказоустойчивые, безостановочные приложения с горячей заменой кода

source: OG title go
ru: Язык GO обучение

source: OG description go
ru: Go — язык общего назначения с широкими возможностями и понятным синтаксисом. Благодаря мультиплатформенности, надежной, хорошо документированной стандартной библиотеке и ориентированности на удобные подходы к самой разработке, Go является идеальным языком для первых шагов в программировании.

source: Header php
ru: PHP для начинающих

source: Header javascript
ru: JavaScript для начинающих

source: Header python
ru: Python для начинающих

source: Header java
ru: Java для начинающих

source: Header html
ru: HTML для начинающих

source: Header css
ru: CSS для начинающих

source: Header racket
ru: Racket для начинающих

source: Header ruby
ru: Ruby для начинающих

source: Header elixir
ru: Elixir для начинающих

source: Header go
ru: Go для начинающих

source: Privacy
ru: Политика конфиденциальности

source: Terms of Service
ru: Условия использования

source: Community
ru: Сообщество

source: Sign Up
ru: Регистрация

source: Password
ru: Пароль

source: Registration
ru: Зарегистрироваться

source: Dont have account?
ru: Нет аккаунта?

source: Forgot Password
ru: Забыли пароль?

source: Oops, something went wrong! Please check the errors below.
ru: Что то пошло не так! Проверьте ошибки в форме

source: Remind Password
ru: Восстановление пароля

source: Trying sign in?
ru: Пытаетесь войти?

source: Confirm registration
ru: Подтверждение регистрации

source: Forgot password?
ru: Забыли пароль?

source: Message with instructions for reset password was sent
ru: Сообщение с инструкциями по сбросу пароля было отправлено на вашу почту

source: Password was change
ru: Пароль был успешно изменен

source: Reset password
ru: Сброс пароля

source: Update Password
ru: Обновить Пароль

source: User not found
ru: Пользователь не найден

source: Signed in successfully.
ru: Вы авторизованы

source: Change Password
ru: Задать новый пароль

source: User created! Check your email for confirm registration
ru: Пользователь успешно создан! Мы выслали вам на почту письмо со ссылкой. Перейдите по ней чтобы завершить регистрацию и войти

source: Registration confirmed! Welcome!
ru: Ваш e-mail подтвержден, и вы авторизованы. Добро пожаловать!

source: There was a problem with your email/password
ru: Неправильные email/пароль

source: Switch language to
ru: Сменить язык на

source: Please confirm the email in your %{provider} account, then try again
ru: Пожалуйста, подтвердите email в аккаунте %{provider}, затем повторите попытку

source: Delete account
ru: Удалить аккаунт

source: Do you really want to delete your account?
ru: Вы уверены, что хотите удалить свой аккаунт

source: Email is not confirmed
ru: Е-mail не подтвержден

source: First name
ru: Имя

source: Last name
ru: Фамилия

source: Nickname
ru: Никнейм

source: Sorry, you have to sign in.
ru: Извините, сначала нужно войти

source: Send an email with a confirmation link again.
ru: Выслать письмо со ссылкой для подтверждения заново.

source: Change password
ru: Изменить пароль

source: Account successfully added.
ru: Аккаунт успешно подключен

source: Error adding account.
ru: Ваш аккаунт уже подключен. Войдите через него и отвяжите социальную сеть в настройках аккаунта. После этого повторите подключение на текущем аккаунте

source: Social networks
ru: Социальные сети

source: Something went wrong! Please contact support <a href=mailto:support@hexlet.io> support@hexlet.io </a>.
ru: Произошла ошибка!Пожалуйста, обратитесь в службу поддержки <a href=mailto:support@hexlet.io> support@hexlet.io </a>.

source: User information
ru: Информация о пользователе

source: Your %{provider} account has been successfully deleted
ru: Ваш %{provider} аккаунт успешно отключен

source: Your account has been successfully deleted
ru: Ваш аккаунт успешно удален

source: Add %{provider} account
ru: Подключить %{provider}

source: Delete %{provider} account
ru: Отключить %{provider}

source: There were problems with the delivery of letters to your address. Please check that emails reach your inbox.
ru: Возникли проблемы с доставкой писем на ваш адрес. Пожалуйста, проверьте, что до вашего электронного ящика доходят письма.

source: We sent an email to confirm the email - %{email}, follow the link from the email to complete the procedure.
ru: Мы отправили письмо для подтверждения email - %{email}, перейдите по ссылке из письма, чтобы завершить процедуру.

source: Free programming courses
ru: Обучение программированию. Онлайн. Бесплатно.

source: Information
ru: Информация

source: Resources
ru: Ресурсы

source: Social
ru: Социальные сети

source: Description php
ru: Бесплатные практические уроки по программированию на PHP для тех, кто начинает с нуля

source: Description javascript
ru: Бесплатные практические уроки по программированию на Javascript для тех, кто начинает с нуля

source: Description python
ru: Бесплатные практические уроки по программированию на Python для тех, кто начинает с нуля

source: Description racket
ru: Бесплатные практические уроки по программированию на Racket (Lisp)

source: Description html
ru: Бесплатные практические уроки по HTML для тех, кто начинает с нуля

source: Description css
ru: Бесплатные практические уроки по CSS для тех, кто начинает с нуля

source: Description ruby
ru: Бесплатные практические уроки по программированию на Ruby

source: Description elixir
ru: Бесплатные практические уроки по программированию на Elixir для тех

source: Description go
ru: Бесплатные практические уроки по программированию на Go для тех

source: Code Basics Description about
ru: Code Basics — качественные интерактивные уроки по основам программирования бесплатно, для всех.

source: Code Basics Description privacy
ru: Политика конфиденциальности Code Basics

source: Code Basics Description tos
ru: Условия использования образовательной платформы Code Basics

source: Code Basics Login Description
ru: Вход

source: Code Basics Login Title
ru: Вход

source: Code Basics Title about
ru: О проекте

source: Code Basics Title privacy
ru: Политика конфиденциальности

source: Code Basics Title tos
ru: Условия использования образовательной платформы

source: Code Basics Registration Description
ru: Регистрация

source: Code Basics Registration Title
ru: Регистрация

source: Code Basics Remind Password Description
ru: Восстановление пароля

source: Code Basics Remind Password Title
ru: Восстановление пароля

source: Dont have an account?
ru: Нет аккаунта?

source: Have an account?
ru: Есть аккаунт?

source: Home
ru: Домой

source: For beginners. From creators %{hexlet_link}
ru: Для тех, кто начинает с нуля. От создателей %{hexlet_link}

source: of Hexlet
ru: Хекслета

source: Sign In Github
ru: Войти через GitHub

source: Congratulations
ru: Поздравляем!

source: Other professions on Hexlet
ru: Другие профессии на Хекслете

source: First courses in the profession are available for free. All you need to start learning is register and join the profession.
ru: Первые курсы в профессии доступны бесплатно. Чтобы начать изучение материала, достаточно зарегистрироваться и вступить в профессию.

source: Get the Hexlet Certificate and employment assistance at the end of your study
ru: Получить сертификат Хекслета и содействие в трудоустройстве по окончании обучения

source: Join the profession on Hexlet. You will:
ru: Вступайте в профессию на Хекслете. Это позволит:

source: Learn how to solve practical problems
ru: Научиться решать практические задачи

source: Write the first complete applications that will be part of your developer portfolio
ru: Написать первые полноценные приложения, которые станут частью вашего портфолио разработчика

source: Get the fundamental programming knowledge
ru: Получить фундаментальные знания программирования

source: This is the first step into the world of professional development. What’s next?
ru: Это первый шаг в мир профессиональной разработки. Что дальше?

source: You have successfully completed the basic course
ru: Вы успешно завершили базовый курс

source: on Code Basics.
ru: на Code Basics.

source: Change course
ru: Выберите курс

source: If you got stuck and don't know what to do, you can ask a question in our huge and friendly
ru: Если вы столкнулись с трудностями и не знаете что делать, можете задать вопрос в нашем большом и дружном

source: community
ru: cообществе
